{
  "info": "Furnitune – Filtered Business Information\n\nAbout Furnitune\n\nFurnitune is an e‑commerce platform for Santos Upholstery. We offer ready‑made furniture, custom furniture orders, furniture repairs, and an AI‑powered recommender that analyzes room photos to suggest items from our catalog.\n\nPurpose & Objectives\n\nOur purpose is to simplify shopping, customization, and maintenance of furniture online while reducing miscommunication via guided options and reference images.\n\nObjectives:1) Sell ready‑made furniture online.2) Support custom orders (dimensions, materials, colors, design references).3) Accept repair requests (with photos) even for items not purchased from us.4) Provide AI‑powered recommendations using CLIP + FAISS.5) Answer customer questions via a business chatbot.\n\nScope and Limitations\n\nScope:- Catalog of ready‑made items with product pages.- Customization flow with guided options and image uploads.- Repair request submission and admin review.- AI recommender based on room photos and preferences.- Business chatbot for product/services/policies.Limitations:- Furniture only (no rugs, curtains, home decor).- AI recommender limited to three runs per user per 24 hours.- Delivery status depends on admin updates.\n\nKey Features\n\nProduct Customization\n\nChoose dimensions, materials, colors, and designs. Upload reference images (e.g., Pinterest/Google) to clarify expectations.\n\nAI Recommender System\n\nUpload a room photo and answer a few questions. CLIP generates embeddings and FAISS retrieves visually similar items from the catalog.\n\nRepair Service\n\nWe accept repair requests even if the item was not purchased from us. Customers upload photos and details; admins review and schedule work.\n\nOrdering & Payment\n\nOrders are placed online and payments are processed via PayMongo.\n\nDelivery & Tracking\n\nCustomers can track deliveries. Status updates are maintained by admins.\n\nPolicies & Customer Information\n\nReturns & Refunds\n\nReturn requests are handled case‑by‑case. Provide order details and photos. Approved refunds/returns follow our posted policy and timelines.\n\nWarranty\n\nBasic workmanship warranty applies to custom and repaired items. Coverage and duration depend on the service category and materials.\n\nData Privacy\n\nPersonal data is used only to fulfill orders, provide services, and improve your experience. We do not sell personal data to third parties.\n\nOperating Hours & Coverage\n\nBusiness Hours: Mon–Sat, 9:00 AM–6:00 PM.Service Coverage: Primary service area is the local region; contact us for special arrangements.\n\nContact Us\n\nPhone: 123‑323‑312Email: Furnitune@jameyl.comLive Chat: Available via the website chatbotLocation: Santos Upholstery main shop\n\nInternal Notes (Skip)\n\n[BOT-SKIP]Team bios, methodologies, Gantt charts, ERD/use cases, references, and capstone‑only appendices.[/BOT-SKIP]"
}